{
  "_name_or_path": "facebook/convnextv2-base-22k-384",
  "architectures": [
    "ConvNextV2ForImageClassification"
  ],
  "depths": [
    3,
    3,
    27,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    128,
    256,
    512,
    1024
  ],
  "id2label": {
    "0": "Bánh bèo",
    "1": "Bánh bột lọc",
    "2": "Bánh căn",
    "3": "Bánh canh",
    "4": "Bánh chưng",
    "5": "Bánh cuốn",
    "6": "Bánh đúc",
    "7": "Bánh giò",
    "8": "Bánh khọt",
    "9": "Bánh mì",
    "10": "Bánh pía",
    "11": "Bánh tét",
    "12": "Bánh tráng nướng",
    "13": "Bánh xèo",
    "14": "Bún bò Huế",
    "15": "Bún đậu mắm tôm",
    "16": "Bún mắm",
    "17": "Bún riêu",
    "18": "Bún thịt nướng",
    "19": "Cá kho tộ",
    "20": "Canh chua",
    "21": "Cao lầu",
    "22": "Cháo lòng",
    "23": "Cơm tấm",
    "24": "Gỏi cuốn",
    "25": "Hủ tiếu",
    "26": "Mì Quảng",
    "27": "Nem chua",
    "28": "Phở bò",
    "29": "Xôi xéo"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Bánh bèo": 0,
    "Bánh bột lọc": 1,
    "Bánh căn": 2,
    "Bánh canh": 3,
    "Bánh chưng": 4,
    "Bánh cuốn": 5,
    "Bánh đúc": 6,
    "Bánh giò": 7,
    "Bánh khọt": 8,
    "Bánh mì": 9,
    "Bánh pía": 10,
    "Bánh tét": 11,
    "Bánh tráng nướng": 12,
    "Bánh xèo": 13,
    "Bún bò Huế": 14,
    "Bún đậu mắm tôm": 15,
    "Bún mắm": 16,
    "Bún riêu": 17,
    "Bún thịt nướng": 18,
    "Cá kho tộ": 19,
    "Canh chua": 20,
    "Cao lầu": 21,
    "Cháo lòng": 22,
    "Cơm tấm": 23,
    "Gỏi cuốn": 24,
    "Hủ tiếu": 25,
    "Mì Quảng": 26,
    "Nem chua": 27,
    "Phở bò": 28,
    "Xôi xéo": 29
  },
  "layer_norm_eps": 1e-12,
  "model_type": "convnextv2",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.39.3"
}
